[
  {
    "title": "React Native Engineer - Flexport",
    "description": "Flexport is a platform for global trade in an industry that comprises 12% of the global GDP.  We are the first licensed freight forwarder and customs brokerage built around a modern tech stack.  We help the world's fastest growing brands manage their international supply chains, providing a fully-managed service for moving products between any two places on the planet. Come work on our React Native app that thousands of truckers use.",
    "fullDescriptionURL": "https://boards.greenhouse.io/flexport/jobs/893975?gh_src=426fe6601"
  },
  {
    "title": "Software Engineer - Flexport",
    "description": "Flexport's mission is to make global trade easy for everyone. We are re-making a trillion dollar industry that touches every person on Earth, which means solving some of the global community's most complex challenges. We are looking for makers who love learning, are passionate about collaborating, and desire to build solutions with a global impact. Help us in this mission by building software.",
    "fullDescriptionURL": "https://boards.greenhouse.io/flexport/jobs/535049?gh_src=b194970e1"
  },
  {
    "title": "Engineering Manager - Flexport",
    "description": "Flexport’s mission is to make global trade easy for everyone. We are re-making a trillion dollar industry that touches every person on Earth, which means solving some of the global community’s most complex challenges. We are looking for makers who love learning, are passionate about collaborating, and desire to build solutions with a global impact. Help us in this mission by managing high quality engineering teams.",
    "fullDescriptionURL": "https://boards.greenhouse.io/flexport/jobs/1138948?gh_src=be861a1c1"
  },
  {
    "title": "Frontend Engineer, Design Systems - Gusto",
    "description": "Gusto’s Design Systems team is responsible for building and maintaining a robust set of well-structured, reusable React components, layouts, and paradigms to help product teams be more productive and build more consistent, delightful experiences for our customers. As an early member of the team you’ll have a unique opportunity to shape how Gusto builds user-facing features for years to come. If you’re passionate about frontend technologies and making a big impact, this role is for you.",
    "fullDescriptionURL": "https://boards.greenhouse.io/gusto/jobs/1317585"
  },
  {
    "title": "Software Engineer, Full-Stack - Gusto",
    "description": "Gusto engineers own entire features in our system. You'll influence the initial specs for the feature, build/modify the backend APIs (mostly Rails), write the front-end code that consumes said APIs (mostly React), and be responsible for ongoing improvements once the feature is deployed. We’re looking for talented and motivated engineers with 4+ years of experience, a passion for technologies such as React and Rails and experience turning wireframes and mockups into elegantly executed code.",
    "fullDescriptionURL": "https://boards.greenhouse.io/gusto/jobs/83332"
  },
  {
    "title": "Software Engineer, Employee Fintech - Gusto",
    "description": "Gusto is looking for entrepreneurial and creative engineers for our Employee Fintech Team. We just launched our Flexible Pay feature that gives employees the freedom to choose their own pay schedule and get paid as soon as the next day. Our team’s responsibilities include brainstorming features with our product team, implementing frontend user experiences and building a robust backend. We’re a small team with a big vision, which means a lot of ownership in shaping the future of our products.",
    "fullDescriptionURL": "https://boards.greenhouse.io/gusto/jobs/1135924"
  },
  {
    "title": "Senior Software Engineer, Customers, Front End - Instacart",
    "description": "Our web products are used by millions of people every year and the largest retailers in the US now trust us to run their grocery delivery websites. In order to meet and exceed these expectations, we're rapidly improving and modernizing our front end code base, raising our expectations for product quality on web, and opening up our internal libraries to the open source community for feedback. We hope to accelerate these efforts by growing the number of strong front end engineers on our teams.",
    "fullDescriptionURL": "https://boards.greenhouse.io/instacart/jobs/1070007"
  },
  {
    "title": "Senior Software Engineer - Instacart",
    "description": "We're looking for experienced engineers to join our fast moving team. We work on a range of interesting and challenging problems, from supporting thousands of concurrent shoppers and processing millions of data points in real time, to determining the best route for deliveries and predicting store inventory levels. There is a tremendous amount of opportunity in front of us, and joining now gives you a chance to grow your career and interests as we succeed.",
    "fullDescriptionURL": "https://boards.greenhouse.io/instacart/jobs/271424"
  }
]
